vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F493x5_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2"
  xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Holtek</vendor>
  <name>HT32F493x5_DFP</name>
  <description>Holtek HT32F493x5 Series Device Support</description>
  <url>https://mcu.holtek.com.tw/pack</url>
  <!-- optional license file -->
  <!--
  <license>
  </license>
  -->

  <releases>
    <release version="1.0.6" date="2023-11-08">
      Update information.
    </release>
    <release version="1.0.5" date="2023-08-28">
      Update information.
    </release>
    <release version="1.0.4" date="2023-06-20">
      Update information.
    </release>
    <release version="1.0.3" date="2023-03-29">
      Update information.
    </release>
    <release version="1.0.2" date="2023-03-16">
      Update CMSIS-Pack Index relate information.
    </release>
    <release version="1.0.1" date="2023-03-15">
      Update firmware library.
    </release>
    <release version="1.0.0" date="2023-01-30">
      First Release version of HT32F493x5 Device Family.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>HOLTEK</keyword>
    <keyword>Device Support</keyword>
    <keyword>HT32F493x5</keyword>
    <keyword>HT32F493</keyword>
    <keyword>HT32</keyword>
  </keywords>

  <devices>

    <!-- ************************  Series 'HT32F493xx'  **************************** -->
    <family Dfamily="HT32F493xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" Dclock="240000000"/>
      <description>
The HT32F49365/HT32F49395 devices are based on the high-performance Arm®Cortex®-M4 32-bit RISC core, operating at a frequency of up to 240 MHz. The Cortex®-M4 core features a Floating Point Unit (FPU) single precision which supports all Arm® single-precision data processing instructions and data types. It also implements a full set of DSP instructions and a Memory Protection Unit (MPU) which enhances application security.

The devices incorporate high-speed embedded memories (up to 1024 KBytes of internal Flash memory, 96 + 128 KBytes of SRAM), external SPI Flash (up to 16 MBytes addressing capability), and a wide range of enhanced GPIOs and peripherals connected to two APB buses. Any block of the embedded Flash memory can be protected by the “sLib” (security library), functioning as a security area with code-executable only.

The devices offer three 12-bit ADCs, two 12-bit DACs, eight general-purpose 16-bit timers plus two general-purpose 32-bit timers, and up to two PWM timers for motor control. They support standard and advanced communication interfaces including up to three I2Cs, four SPIs (all multiplexed as I2Ss), two SDIOs, eight USARTs/UARTs, an USBFS, and two CANs.

The HT32F49365/HT32F49395 devices operate in the -40 to +105 °C temperature range, from a 2.6 to 3.6 V power supply. A comprehensive set of power-saving mode allows the design of low-power application.

The HT32F49365/HT32F49395 are supplied in different package types. The entire HT32F49365/HT32F49395 series of devices are fully pin-to-pin, software and functionally compatible with each other, except that the configurations of peripherals are not completely identical, depending on the package types.
      </description>

      <subFamily DsubFamily="HT32F49365/49395">
        <compile header="Device/Include/ht32f493x5.h"/>
        <debug svd="SVD/HT32F493x5.svd"/>
        <algorithm name="Flash/HT32F493x5_USD.FLM" start="0x1FFFF800" size="0x00040" default="0"/>
        <algorithm name="Flash/HT32F493x5_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        <algorithm name="Flash/HT32F493x5_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        <algorithm name="Flash/HT32F493x5_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        <algorithm name="Flash/HT32F493x5_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        <feature type="XTAL" n="4000000" m="25000000"/>
        <feature type="IntRC" n="8000000"/>
        <feature type="RTC" n="32768"/>
        <feature type="VCC" n="2.60" m="3.60"/>
        <feature type="Temp" n="-40" m="105"/>
        <feature type="PowerMode" n="4" name="Run, Sleep, Deepsleep, Standby"/>
        <feature type="ExtInt" n="20"/>
        <feature type="DMA" n="14" name="DMA Controller"/>
        <feature type="DAC" n="2" m="12" name="DAC1/DAC2"/>
        <feature type="Timer" n="2" m="16" name="Basic timer"/>
        <feature type="Timer" n="8" m="16" name="16-bit General-purpose timer"/>
        <feature type="Timer" n="2" m="32" name="32-bit General-purpose timer"/>
        <feature type="Timer" n="2" m="16" name="Advanced-control timer"/>
        <feature type="WDT" n="2"/>
        <feature type="USBD" n="1"/>
        <feature type="CAN" n="2"/>
        <feature type="USART" n="4"/>
        <feature type="SPI" n="4"/>
        <feature type="I2S" n="4"/>
        <feature type="I2C" n="3"/>
        <feature type="ClockOther" name="HICK auto clock calibration (ACC)"/>
        <feature type="Other" n="1" name="CRC"/>


        <!-- *************************  Device 'HT32F49365_48LQFP'  ***************************** -->
        <device Dname="HT32F49365_48LQFP">
          <compile define="USE_HT32F49365_48LQFP"/>
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"     init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <feature type="UART" n="3"/>
          <feature type="SDIO" n="1" m="4"/>
          <feature type="ADC" n="10" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>

        <!-- *************************  Device 'HT32F49365_48QFN'  ***************************** -->
        <device Dname="HT32F49365_48QFN">
          <compile define="USE_HT32F49365_48QFN"/>
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"     init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <feature type="UART" n="3"/>
          <feature type="SDIO" n="1" m="4"/>
          <feature type="ADC" n="10" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="QFN"/>
        </device>

