vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F493x5_DFP.pdsc
        <!-- *************************  Device 'HT32F49365_64LQFP'  ***************************** -->
        <device Dname="HT32F49365_64LQFP">
          <compile define="USE_HT32F49365_64LQFP"/>
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"     init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <feature type="UART" n="4"/>
          <feature type="SDIO" n="2" m="8"/>
          <feature type="ADC" n="16" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="ExtBus" n="8" name="XMC"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>

        <!-- *************************  Device 'HT32F49365_100LQFP'  ***************************** -->
        <device Dname="HT32F49365_100LQFP">
          <compile define="USE_HT32F49365_100LQFP"/>
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"     init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <feature type="UART" n="4"/>
          <feature type="SDIO" n="2" m="8"/>
          <feature type="ADC" n="16" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="ExtBus" n="16" name="XMC"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>

        <!-- *************************  Device 'HT32F49395_48LQFP'  ***************************** -->
        <device Dname="HT32F49395_48LQFP">
          <compile define="USE_HT32F49395_48LQFP"/>
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_1024.FLM" start="0x08000000" size="0x100000" default="1"/>
          <feature type="UART" n="3"/>
          <feature type="SDIO" n="1" m="4"/>
          <feature type="ADC" n="10" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>

        <!-- *************************  Device 'HT32F49395_48QFN'  ***************************** -->
        <device Dname="HT32F49395_48QFN">
          <compile define="USE_HT32F49395_48QFN"/>
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_1024.FLM" start="0x08000000" size="0x100000" default="1"/>
          <feature type="UART" n="3"/>
          <feature type="SDIO" n="1" m="4"/>
          <feature type="ADC" n="10" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="QFN"/>
        </device>

        <!-- *************************  Device 'HT32F49395_64LQFP'  ***************************** -->
        <device Dname="HT32F49395_64LQFP">
          <compile define="USE_HT32F49395_64LQFP"/>
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_1024.FLM" start="0x08000000" size="0x100000" default="1"/>
          <feature type="UART" n="4"/>
          <feature type="SDIO" n="2" m="8"/>
          <feature type="ADC" n="16" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="ExtBus" n="8" name="XMC"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>

        <!-- *************************  Device 'HT32F49395_100LQFP'  ***************************** -->
        <device Dname="HT32F49395_100LQFP">
          <compile define="USE_HT32F49395_100LQFP"/>
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x38000"      init   ="0" default="1"/>
          <algorithm name="Flash/HT32F493x5_1024.FLM" start="0x08000000" size="0x100000" default="1"/>
          <feature type="UART" n="4"/>
          <feature type="SDIO" n="2" m="8"/>
          <feature type="ADC" n="16" m="12" name="ADC1/ADC2/ADC3"/>
          <feature type="ExtBus" n="16" name="XMC"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="HT32F493x5">
      <description>Holtek HT32F493x5 Devices</description>
      <require Dvendor="Holtek:106" Dname="HT32F493*5*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <condition id="HT32F493x5 ARMCC">
      <description>Holtek HT32F493x5 Series devices</description>
      <require Dvendor="Holtek:106" Dname="HT32F493*5*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="HT32F493x5 CMSIS">
      <description>Holtek HT32F493x5 Devices and CMSIS-CORE</description>
      <require condition="HT32F493x5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="ht32f493x5_conf"/>
      <require Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="crm"/>
    </condition>

    <!-- HT32F493x5 STDPERIPHERALS CRM Conditions -->
    <condition id="HT32F493x5 STDPERIPHERALS CRM">
      <description>Holtek HT32F493x5 Standard Peripherals Drivers with CRM</description>
      <require condition="HT32F493x5 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="crm"/>
    </condition>

    <!-- HT32F493x5 STDPERIPHERALS MISC Conditions -->
    <condition id="HT32F493x5 STDPERIPHERALS MISC">
      <description>Holtek HT32F493x5 Standard Peripherals Drivers with MISC</description>
      <require condition="HT32F493x5 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="misc"/>
    </condition>

