vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F493x5_DFP.pdsc
    <!-- HT32F493x5 STDPERIPHERALS EVAL Conditions -->
    <condition id="HT32F493x5 STDPERIPHERALS EVB">
      <description>Holtek HT32F493x5 Standard Peripherals Drivers with EVB</description>
      <require condition="HT32F493x5 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="gpio"/>
      <require Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="exint"/>
      <require Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="usart"/>
    </condition>
  </conditions>

  <components>
    <!-- HT32F493x5_firmware_library -->
    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="acc" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Auto Clock Calibration (ACC) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ACC
      </RTE_Components_h>
      <files>
        <!-- ACC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_acc.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_acc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="adc" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Analog-to-digital converter (ADC) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
      </RTE_Components_h>
      <files>
        <!-- ADC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_adc.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_adc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="bpr" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Battery Powered Register (BPR) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BPR
      </RTE_Components_h>
      <files>
        <!-- BPR file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_bpr.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_bpr.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="can" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>CAN (CAN) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
      </RTE_Components_h>
      <files>
        <!-- CAN file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_can.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_can.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="crc" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Cyclic Redundancy Check (CRC) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
      </RTE_Components_h>
      <files>
        <!-- CRC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_crc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_crc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="crm" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS MISC">
      <description>Clock and Reset Management (CRM) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRM
      </RTE_Components_h>
      <files>
        <!-- CRM file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_crm.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_crm.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="dac" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Digital-to-Analog-to converter (DAC) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
      </RTE_Components_h>
      <files>
        <!-- DAC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_dac.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_dac.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="debug" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Debug (DEBUG) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DEBUG
      </RTE_Components_h>
      <files>
        <!-- DEBUG file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_debug.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_debug.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="dma" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Direct Memory Access (DMA) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
      </RTE_Components_h>
      <files>
        <!-- DMA file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_dma.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_dma.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="exint" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>External Interrupt/Event (EXINT) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXINT
      </RTE_Components_h>
      <files>
        <!-- EXINT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_exint.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_exint.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="flash" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Flash Memory Controller (FLASH) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FLASH
      </RTE_Components_h>
      <files>
        <!-- FLASH file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_flash.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_flash.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="gpio" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
      </RTE_Components_h>
      <files>
        <!-- GPIO file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_gpio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_gpio.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="i2c" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Inter-integrated Circuit (I2C) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
      </RTE_Components_h>
      <files>
        <!-- I2C file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_i2c.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_i2c.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="misc" Cversion="1.0.0" condition="HT32F493x5 CMSIS">
      <description>MISC driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
      </RTE_Components_h>
      <files>
        <!-- MISC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_misc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_misc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="pwc" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
      </RTE_Components_h>
      <files>
        <!-- PWC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_pwc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_pwc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="rtc" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Real-time Clock (RTC) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
      </RTE_Components_h>
      <files>
        <!-- RTC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_rtc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_rtc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="sdio" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>SD/SDIO MMC card host interface (SDIO) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
      </RTE_Components_h>
      <files>
        <!-- SDIO file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_sdio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_sdio.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="spi" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
      </RTE_Components_h>
      <files>
        <!-- SPI file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_spi.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_spi.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="tmr" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>TIMER driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
      </RTE_Components_h>
      <files>
        <!-- TTMER file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_tmr.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_tmr.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="usart" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
      </RTE_Components_h>
      <files>
        <!-- USART file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_usart.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_usart.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="usb" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Universal Serial Bus driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USB
      </RTE_Components_h>
      <files>
        <!-- USB file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_usb.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_usb.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="wdt" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>watchdog timer(WDT) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
      </RTE_Components_h>
      <files>
        <!-- WDT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_wdt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_wdt.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="wwdt" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
      </RTE_Components_h>
      <files>
        <!-- WWDT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_wwdt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_wwdt.c" attr="config" version="1.0.0" />
      </files>
    </component>

