vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F493x5_DFP.pdsc
    <component Cclass="Device" Cgroup="ht32f493x5_firmware_library" Csub="xmc" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS CRM">
      <description>External Memory Controller (XMC) driver for HT32F493x5 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_XMC
      </RTE_Components_h>
      <files>
        <!-- XMC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f493x5_xmc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f493x5_xmc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <!-- Utilities HT32F493x5 -->
    <component Cclass="Device" Cgroup="evb" Csub="ht32f49395_sk" Cversion="1.0.0" condition="HT32F493x5 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/ht32f493x5_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/ht32f493x5_board.c" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Config HT32F493x5 -->
    <component Cclass="Device" Cgroup="ht32f493x5_conf" Cversion="1.0.0" condition="HT32F493x5 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/ht32f493x5_conf.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup HT32F493x5  -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="HT32F493x5">
      <description>System Startup for Holtek HT32F493x5  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/ht32f493x5.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_ht32f493x5.s" attr="config" version="1.0.0" condition="HT32F493x5 ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_ht32f493x5.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

  <boards>

    <board vendor="Holtek" name="ESK32-31401 (HT32F49395)" revision="Ver 1.0" orderForm="https://www.bestmodulescorp.com/esk32-31401.html">
      <description>Holtek ESK32-31401 HT32F49395 Starter Kit</description>
      <image large="https://mcu.holtek.com.tw/ht32/images/ESK32-31401.jpg"/>
      <book category="overview" name="https://www.holtek.com/esk32-31401" title="ESK32-31401 Starter Kit Web Page"/>
      <mountedDevice deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F49395_100LQFP"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F49365/49395"/>
      <feature type="ODbg" n="1" name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL" n="8000000"/>
      <feature type="PWR" n="4" name="USB Powered"/>
      <feature type="DIO" n="80" name="Digital I/Os (depending on configuration)"/>
      <feature type="USB" n="1" name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button" n="1" name="Reset Button"/>
      <feature type="LED" n="5" name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF" n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

  </boards>

</package>
